bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/pca10040/s132/ses/main.c
// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {BLE_UUID_BATTERY_SERVICE,BLE_UUID_TYPE_BLE},    
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};


static void advertising_start(bool erase_bonds);

//Start of my section
//This is just a sparkfun reference I am using to develop code, it should always be 0
#define SPARKFUN 1
#if SPARKFUN
#define UART_RX_PIN   26
#define UART_TX_PIN   27

#define BUZZER_10MM   31

//VLX6180
//SHDN
#define GP0       24
//GPIO
#define GP1       23
#define I2C0_SCL  22
#define I2C0_SDA  20

//microphone
#define MIC_CLK   8
#define MIC_DI    11
#define MIC_WS    5

//motors
#define M1        3
#define M0        12
#define DIR_L     2
#define STEP      1
#define DIR_R     4

//actually red
#define GREEN_LED 7

#else
//Buzzer
#define BUZZER_10MM   10

//microphone
#define MIC_CLK   28
#define MIC_DI    29
#define MIC_WS    27

//VLX6180
#define GP0       14
#define GP1       13
#define I2C0_SCL  15
#define I2C0_SDA  16

//motors
#define M1        25
#define M0        23
#define DIR_L     22
#define STEP      30
#define DIR_R     26
//LED
#define GREEN_LED 2

#endif

// TWI instance ID. 
#define TWI_INSTANCE_ID 0

/* Indicates if operation on TWI has ended. */
volatile bool m_xfer_done = false;

/* TWI instance. */
const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);

/* Buffer for samples read from temperature sensor. */
static uint8_t m_sample;



#define GRAPH_WINDOW_HEIGHT              20                              //!< Graph window height used in draw function.

#define FPU_EXCEPTION_MASK               0x0000009F                      //!< FPU exception mask used to clear exceptions in FPSCR register.
#define FPU_FPSCR_REG_STACK_OFF          0x40                            //!< Offset of FPSCR register stacked during interrupt handling in FPU part stack.

// We want to use 44100 Hz sampling rate to reach 22050Hz band. 128 (64 pairs) samples are used
// in FFT calculation with result contains 64 bins (22050Hz/64bins -> ~344,5Hz per bin).
#define FFT_TEST_SAMPLE_FREQ_HZ          44100.0f                        //!< Frequency of complex input samples.
#define FFT_TEST_COMP_SAMPLES_LEN        128                             //!< Complex numbers input data array size. Correspond to FFT calculation this number must be power of two starting from 2^5 (2^4 pairs) with maximum value 2^13 (2^12 pairs).
#define FFT_TEST_OUT_SAMPLES_LEN         (FFT_TEST_COMP_SAMPLES_LEN / 2) //!< Output array size.

#define SIGNALS_RESOLUTION               100.0f                          //!< Sine wave frequency and noise amplitude resolution. To count resolution as decimal places in number use this formula: resolution = 1/SIGNALS_RESOLUTION .
#define SINE_WAVE_FREQ_MAX               20000                           //!< Maximum frequency of generated sine wave.
#define NOISE_AMPLITUDE                  1                               //!< Amplitude of generated noise added to signal.

static uint32_t  m_ifft_flag             = 0;                            //!< Flag that selects forward (0) or inverse (1) transform.
static uint32_t  m_do_bit_reverse        = 1;                            //!< Flag that enables (1) or disables (0) bit reversal of output.
static float32_t m_fft_input_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT input array. Time domain.
static float32_t m_fft_output_f32[FFT_TEST_OUT_SAMPLES_LEN];             //!< FFT output data. Frequency domain.
void afunc(void);
void uart_init(void);
void sendbytes(uint8_t a);
uint8_t sendbuffer[64];
uint8_t recvbuffer[64];
void my_configure(void);
void configure_motors(void);
void motors_forward(void);
void motors_backward(void);
void configure_microphone(void);
void pwm_motor_stepping(uint32_t steps_per_second);
void pwm_buzzer_frequency(float freq);
void configure_VLX6180(void);
void VLX6180_init(void);
void read_sensor_data(void);
void twi_init(void);
void charging(void);
void stop_buzzer(void);
void stop_motors(void);

#define SAMPLE_BUFFER_CNT 1024
int16_t sample_buffer[SAMPLE_BUFFER_CNT*2];

/**
 * Motor might be 15 degrees per step, so 24 steps per revolution.
 * 83.3rpm = 15ms * 2 = 30ms period, 33Hz/24*60s
 */
int main(void)
{
    static uint8_t flipper = 0, lowhigh  = 0, range;
    int16_t i;
    uint32_t cnt, cnt2;
    float freq[8] = { 440.0, 460.0, 470.0, 480.0, 2600, 2300, 2100, 1800 };
    bool erase_bonds;

    //nrf_gpio_cfg(GREEN_LED,NRF_GPIO_PIN_DIR_OUTPUT,NRF_GPIO_PIN_INPUT_DISCONNECT,NRF_GPIO_PIN_PULLUP,NRF_GPIO_PIN_S0H1,NRF_GPIO_PIN_NOSENSE);

    nrf_gpio_cfg_output(GREEN_LED);
    nrf_gpio_pin_clear(GREEN_LED);
    
    //charging();    
 
    #if SPARKFUN
      uart_init();
    #endif
    
    configure_VLX6180();

    // Initialize.
    log_init();
    timers_init();
    //buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
   // NRF_LOG_INFO("Template example started.");
    application_timers_start();

    advertising_start(erase_bonds);

    configure_motors();
    my_configure();
    pwm_motor_stepping(100);
   
    pwm_buzzer_frequency(2000);
    // Enter main loop.
    cnt = 0;
    for (;;)
    {
        ++cnt;
        if( cnt == 8)
        {
          stop_buzzer(); 
          stop_motors();
        }
        range = getDistance();
        if (range <= 50)
          nrf_gpio_pin_set(GREEN_LED);
        nrf_delay_ms(1000);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(1000);
        nrf_gpio_pin_set(DIR_R);
        nrf_delay_ms(300);
        nrf_gpio_pin_clear(DIR_R);

      // if (NRF_LOG_PROCESS() == false)
        {
            //power_manage();
        }
    }  

    while(1)
    {
        nrf_gpio_pin_set(GREEN_LED);
        nrf_delay_ms(300);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(300);

        do
        {
            __WFE();
        }while (m_xfer_done == false);

        read_sensor_data();
    }   
    configure_motors();
    my_configure();
    configure_microphone();

    for(i=0;(i<SAMPLE_BUFFER_CNT*2);i++)
        sample_buffer[i] = 0;
    pwm_buzzer_frequency(2000);
    //pwm_motor_stepping(2000);
    while(1)
    {
      NRF_PDM->EVENTS_STARTED = 0;
      NRF_PDM->TASKS_START = 1;
      nrf_delay_ms(100);
      NRF_PDM->TASKS_STOP = 1;
      while( NRF_PDM->EVENTS_STOPPED == 0) ;
      NRF_PDM->EVENTS_STOPPED = 0;
      sendbytes(0);
      afunc();
      nrf_gpio_pin_set(GREEN_LED);
      nrf_delay_ms(4000);
      sendbytes(1);
      memset(sample_buffer,0,SAMPLE_BUFFER_CNT*2);
      nrf_gpio_pin_clear(GREEN_LED);
      nrf_delay_ms(500);

