bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/pca10040/s132/ses/main.c
    }
    cnt = 39;
    cnt2 = 0;
    i = 0;
    flipper = 0;
    while(1)
    {
         pwm_buzzer_frequency(freq[i++]);
         if (i == 8)
          i = 0;
  
        nrf_delay_ms(500);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_set(GREEN_LED);
    }
    
}

void motors_forward(void)
{
  nrf_gpio_pin_clear(DIR_R);
  nrf_gpio_pin_set(DIR_L);
}

void motors_backward(void)
{
   nrf_gpio_pin_clear(DIR_L);
   nrf_gpio_pin_set(DIR_R);
}

static void battery_level_update(void)
{

    ret_code_t err_code;
    uint8_t  battery_level;

    battery_level = 90;
    
    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}


void configure_VLX6180(void)
{
    twi_init();
    VLX6180_init();
}

void VLX6180_init(void)
{
    nrf_gpio_cfg_output(GP0);   //power up is chip enable
    nrf_gpio_pin_set(GP0);
    nrf_gpio_cfg_input(GP1,NRF_GPIO_PIN_NOPULL);    //open drain interrupt
  
    VL6180xInit();
    VL6180xDefautSettings();
}

__STATIC_INLINE void data_handler(uint8_t temp)
{

}

void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                data_handler(m_sample);
            }
            m_xfer_done = true;
            break;
        default:
            break;
    }
}

void twi_init(void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_VLX6180_config = {
       .scl                = I2C0_SCL,
       .sda                = I2C0_SDA,
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_VLX6180_config, NULL, NULL);

    nrf_drv_twi_enable(&m_twi);
}


void read_sensor_data(void)
{
    m_xfer_done = false;

    /* Read 1 byte from the specified address - skip 3 bits dedicated for fractional part of temperature. */
    //ret_code_t err_code = nrf_drv_twi_rx(&m_twi, LM75B_ADDR, &m_sample, sizeof(m_sample));

}

void pwm_motor_stepping(uint32_t steps_per_second)
{

  volatile static uint32_t pwm_duty[2], cnt_128k;

  cnt_128k = 128000 / steps_per_second;  
  pwm_duty[0] = pwm_duty[1] = cnt_128k / 2;

  NRF_PWM1->COUNTERTOP = (cnt_128k << PWM_COUNTERTOP_COUNTERTOP_Pos); 
  NRF_PWM1->SEQ[0].PTR = pwm_duty;
  NRF_PWM1->SEQ[0].CNT = (1 << PWM_SEQ_CNT_CNT_Pos);
  NRF_PWM1->TASKS_SEQSTART[0] = 1;   
}

//125000/freq=    125000/250
void pwm_buzzer_frequency(float freq)
{
  float main_freq;
  volatile static uint16_t pwm_top, pwm_duty[2];
   
  main_freq = 125000.0 / freq;

  pwm_top = (uint16_t)main_freq;
  pwm_duty[0] = pwm_duty[1] = (uint16_t)(main_freq / 2.0);

  NRF_PWM0->COUNTERTOP = (pwm_top << PWM_COUNTERTOP_COUNTERTOP_Pos); //1 msec
  NRF_PWM0->SEQ[0].PTR = (uint32_t)(pwm_duty);
  NRF_PWM0->SEQ[0].CNT = (1 << PWM_SEQ_CNT_CNT_Pos);
  NRF_PWM0->TASKS_SEQSTART[0] = 1;   
}

void stop_buzzer(void)
{
  NRF_PWM0->TASKS_STOP = 1;
}

void stop_motors(void)
{
  NRF_PWM1->TASKS_STOP = 1;
}


#if SPARKFUN
void uart_init(void)
{
  NRF_UARTE0->BAUDRATE = 0x00275000; //9600bps
  NRF_UARTE0->PSEL.RXD = UART_RX_PIN;
  NRF_UARTE0->PSEL.TXD = UART_TX_PIN;
  NRF_UARTE0->TXD.PTR = sendbuffer;
  NRF_UARTE0->RXD.PTR = recvbuffer;
  NRF_UARTE0->TXD.MAXCNT = 20;
  NRF_UARTE0->RXD.MAXCNT = 20;
  NRF_UARTE0->CONFIG = 0;  //Enable  stop bit, no parity
  NRF_UARTE0->ENABLE = 8;
}
#endif

void configure_microphone(void)
{
  nrf_gpio_cfg_output(MIC_CLK);
  nrf_gpio_pin_clear(MIC_CLK);
  nrf_gpio_cfg_input(MIC_DI,GPIO_PIN_CNF_PULL_Disabled);

  NRF_PDM->PSEL.CLK = MIC_CLK;
  NRF_PDM->PSEL.DIN = MIC_DI;
  nrf_gpio_cfg_output(MIC_WS);
  nrf_gpio_pin_set(MIC_WS);   //Left, data on rising edge of clock
  NRF_PDM->MODE = 3;
  //NRF_PDM->PDMCLKCTRL = 0x08800000;
  NRF_PDM->GAINL = 0;  
  NRF_PDM->GAINR = 0;
  NRF_PDM->SAMPLE.PTR = sample_buffer;
  NRF_PDM->SAMPLE.MAXCNT = SAMPLE_BUFFER_CNT;
  NRF_PDM->ENABLE = 1;
}

void my_configure(void)
{
  nrf_gpio_cfg_output(BUZZER_10MM);
  nrf_gpio_pin_clear(BUZZER_10MM);
  NRF_PWM0->PSEL.OUT[0] = (BUZZER_10MM << PWM_PSEL_OUT_PIN_Pos) | (PWM_PSEL_OUT_CONNECT_Connected << PWM_PSEL_OUT_CONNECT_Pos);
  NRF_PWM0->ENABLE = (PWM_ENABLE_ENABLE_Enabled << PWM_ENABLE_ENABLE_Pos);
  NRF_PWM0->MODE = (PWM_MODE_UPDOWN_Up << PWM_MODE_UPDOWN_Pos);
  NRF_PWM0->PRESCALER = (PWM_PRESCALER_PRESCALER_DIV_128 << PWM_PRESCALER_PRESCALER_Pos);
  NRF_PWM0->LOOP = (PWM_LOOP_CNT_Disabled << PWM_LOOP_CNT_Pos);
  NRF_PWM0->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
  NRF_PWM0->SEQ[0].REFRESH = 0;
  NRF_PWM0->SEQ[0].ENDDELAY = 0;
 
  NRF_PWM1->PSEL.OUT[0] = (STEP << PWM_PSEL_OUT_PIN_Pos) | (PWM_PSEL_OUT_CONNECT_Connected << PWM_PSEL_OUT_CONNECT_Pos);
  NRF_PWM1->ENABLE = (PWM_ENABLE_ENABLE_Enabled << PWM_ENABLE_ENABLE_Pos);
  NRF_PWM1->MODE = (PWM_MODE_UPDOWN_Up << PWM_MODE_UPDOWN_Pos);
  NRF_PWM1->PRESCALER = (PWM_PRESCALER_PRESCALER_DIV_128 << PWM_PRESCALER_PRESCALER_Pos);
  NRF_PWM1->LOOP = (PWM_LOOP_CNT_Disabled << PWM_LOOP_CNT_Pos);
  NRF_PWM1->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
  NRF_PWM1->SEQ[0].REFRESH = 0;
  NRF_PWM1->SEQ[0].ENDDELAY = 0;
}

void configure_motors(void)
{
    nrf_gpio_cfg_output(STEP);
    nrf_gpio_cfg_output(DIR_L);
    nrf_gpio_cfg_output(M1);
    nrf_gpio_cfg_output(M0);
    nrf_gpio_cfg_output(DIR_R);
  
    nrf_gpio_pin_clear(STEP);
    nrf_gpio_pin_set(DIR_L);
    nrf_gpio_pin_clear(DIR_R);
    nrf_gpio_pin_clear(M1);
    nrf_gpio_pin_clear(M0);
 }


void charging(void)
{
    for (;;)
    {
        nrf_gpio_pin_set(GREEN_LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(500);
    }
}

