bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/pca10040/s132/ses/main.c
void sendbytes(uint8_t which)
{
  uint8_t i, j;
  static uint8_t buf[32];
  float32_t max_value, scalar_factor;
  uint32_t  max_val_index;
  int16_t actual_value;

  if (which == 0)
  {
    // Search FFT max value in input array.
    arm_max_f32(m_fft_output_f32, 64, &max_value, &max_val_index);

    scalar_factor = max_value / 100.0f;

    for(i=0;(i<64);i++)
    {
        sprintf(buf,"%d,",(uint8_t)(m_fft_output_f32[i]/scalar_factor));
        j=0;
        while(buf[j] != 0)
        {
            sendbuffer[j] = buf[j];
            ++j;
            if (j > 20)
            {
              j = 20;
              break;
            }
        }
        NRF_UARTE0->TXD.MAXCNT = j;
        NRF_UARTE0->TASKS_STARTTX = 1;
        nrf_delay_ms(20);
        while(NRF_UARTE0->EVENTS_ENDTX != 1);
     }
   }
   else
   {

    for(i=0;(i<64);i++)
    {
        actual_value = sample_buffer[i+500]; 
        sprintf(buf,"%d,",actual_value);
        j=0;
        while(buf[j] != 0)
        {
            sendbuffer[j] = buf[j];
            ++j;
            if (j > 20)
            {
              j = 20;
              break;
            }
        }
        NRF_UARTE0->TXD.MAXCNT = j;
        NRF_UARTE0->TASKS_STARTTX = 1;
        nrf_delay_ms(20);
        while(NRF_UARTE0->EVENTS_ENDTX != 1);
     }
   }
   sendbuffer[0] = 13;
   sendbuffer[1] = 10;
   NRF_UARTE0->TXD.MAXCNT = 2;
   NRF_UARTE0->TASKS_STARTTX = 1;

}


/**
 * @brief Function for generating sine wave samples for FFT calculations.
 *
 * This function fill up output array with generated sine wave data with proper sampling frequency.
 * Must be executed before fft_process function.
 *
 * @param[in] p_input     Input array to fill with sine wave generated data.
 * @param[in] size        Input array size.
 * @param[in] sample_freq Sine wave sampling frequency.
 * @param[in] sine_freq   Sine wave frequency.
 * @param[in] add_noise   Flag for enable or disble adding noise for generated data.
 */
static void fft_generate_samples(float32_t * p_input,
                                 uint16_t    size,
                                 float32_t   sampling_freq,
                                 float32_t   sine_freq,
                                 bool        add_noise)
{
    uint32_t i;

    /* Remember that sample is represented as two next values in array. */
    uint32_t sample_idx = 0;

    if (2 > size)
    {
        return;
    }

    for (i = 0; i < (size - 1UL); i += 2) {
        sample_idx = i / 2;
        // Real part.
        p_input[(uint16_t)i] = sin(sine_freq * (2.f * PI) * sample_idx / sampling_freq);
        if (add_noise)
        {
            // Noise can be positive or negative number. Numbers can be cast to signed values.
            p_input[(uint16_t)i] *= ((rand()) % ((int)(NOISE_AMPLITUDE * SIGNALS_RESOLUTION)))
                                    / SIGNALS_RESOLUTION;
        }
        // Img part.
        p_input[(uint16_t)i + 1] = 0;
    }
}

/**
 * @brief Function for processing generated sine wave samples.
 * @param[in] p_input        Pointer to input data array with complex number samples in time domain.
 * @param[in] p_input_struct Pointer to cfft instance structure describing input data.
 * @param[out] p_output      Pointer to processed data (bins) array in frequency domain.
 * @param[in] output_size    Processed data array size.
 */
static void fft_process(float32_t *                   p_input,
                        const arm_cfft_instance_f32 * p_input_struct,
                        float32_t *                   p_output,
                        uint16_t                      output_size)
{
    // Use CFFT module to process the data.
    arm_cfft_f32(p_input_struct, p_input, m_ifft_flag, m_do_bit_reverse);
    // Calculate the magnitude at each bin using Complex Magnitude Module function.
    arm_cmplx_mag_f32(p_input, p_output, output_size);
}

/**
 * @brief Function for application main entry.
 */
void afunc(void)
{
    uint32_t  err_code, i;
    bool      noise = false;
    float32_t sine_freq;

        // Generate new samples.
        noise = 0;
        // Sine wave frequency must be positive number so cast rand to unsigned number.
        // stdlib using with Segger Embedded Studio uses rand() configured to return values up to
        // 32767 instead of 0x7fffffff configured in other compilers. It causes that generated sine
        // frequency is smaller, but example works in the same way.
   //     sine_freq = (((uint32_t)rand()) % ((uint32_t)(SINE_WAVE_FREQ_MAX * SIGNALS_RESOLUTION)))
          //          / SIGNALS_RESOLUTION;
     //   fft_generate_samples(m_fft_input_f32,
       //                      FFT_TEST_COMP_SAMPLES_LEN,
         //                    FFT_TEST_SAMPLE_FREQ_HZ,
           //                  sine_freq, noise);
        for(i=0;(i<FFT_TEST_COMP_SAMPLES_LEN);i++)
        {
              m_fft_input_f32[(uint16_t)i] = sample_buffer[i+50];
              //m_fft_input_f32[(uint16_t)i] += sin((5000.0f * (2.f * PI) * i)/FFT_TEST_COMP_SAMPLES_LEN);
        }
        // Process generated data. 64 pairs of complex data (real, img). It is important to use
        // proper arm_cfft_sR_f32 structure associated with input/output data length.
        // For example:
        //  - 128 numbers in input array (64 complex pairs of samples) -> 64 output bins power data -> &arm_cfft_sR_f32_len64.
        //  - 256 numbers in input array (128 complex pairs of samples) -> 128 output bins power data -> &arm_cfft_sR_f32_len128.
        fft_process(m_fft_input_f32,
                    &arm_cfft_sR_f32_len64,
                    m_fft_output_f32,
                    FFT_TEST_OUT_SAMPLES_LEN);


#ifndef FPU_INTERRUPT_MODE
        /* Clear FPSCR register and clear pending FPU interrupts. This code is base on
         * nRF5x_release_notes.txt in documentation folder. It is necessary part of code when
         * application using power saving mode and after handling FPU errors in polling mode.
         */
        __set_FPSCR(__get_FPSCR() & ~(FPU_EXCEPTION_MASK));
        (void) __get_FPSCR();
        NVIC_ClearPendingIRQ(FPU_IRQn);
#endif

